export type NewsItemType = {
    id: string;
    date: string;
    title: string;
    content: string;
};

export const newsItems: NewsItemType[] = [
    {
        id: "1",
        date: "2022.09.05",
        title: "台風接近に伴う営業時間変更のお知らせ",
        content:
            "台風の接近に伴い、営業時間を変更します。ご了承ください。台風の影響が大きい地域では、安全を第一に考えて営業時間を調整します。詳細な情報は、当店のホームページやSNSでお知らせします。",
    },
    {
        id: "2",
        date: "2022.03.16",
        title: "新型コロナウイルス対策に伴うお客様へのお願い",
        content:
            "新型コロナウイルス対策として、各種対策を実施中です。店内の衛生状態を向上させるために、定期的な消毒を行っています。また、スタッフ全員がマスクを着用し、体内の衛生状態を管理しています。",
    },
    {
        id: "3",
        date: "2022.01.01",
        title: "新年のお知らせ",
        content:
            "新年を迎え、営業を開始します。ご来店をお待ちしております。新年には、新しい商品やサービスを導入予定です。詳細な情報は、当店のホームページやSNSでお知らせします。",
    },
    {
        id: "4",
        date: "2021.12.24",
        title: "クリスマスのお知らせ",
        content:
            "クリスマス期間中の営業時間についてお知らせします。クリスマスイブは、特別な営業時間で営業します。詳細な情報は、当店のホームページやSNSでお知らせします。",
    },
    {
        id: "5",
        date: "2021.11.11",
        title: "新商品の発売のお知らせ",
        content:
            "新商品を発売します。ご購入をお待ちしております。新商品は、人気のある商品に新しい機能を追加したものです。詳細な情報は、当店のホームページやSNSでお知らせします。",
    },
    {
        id: "6",
        date: "2021.10.01",
        title: "秋の営業時間変更のお知らせ",
        content:
            "秋の営業時間を変更します。ご了承ください。秋の営業時間変更は、季節の変化に伴うものです。詳細な情報は、当店のホームページやSNSでお知らせします。",
    },
    {
        id: "7",
        date: "2021.09.01",
        title: "夏の営業時間変更のお知らせ",
        content:
            "夏の営業時間を変更します。ご了承ください。夏の営業時間変更は、季節の変化に伴うものです。詳細な情報は、当店のホームページやSNSでお知らせします。",
    },
    {
        id: "8",
        date: "2021.07.01",
        title: "夏休みのお知らせ",
        content:
            "夏休み期間中の営業時間についてお知らせします。夏休み期間中は、特別な営業時間で営業します。詳細な情報は、当店のホームページやSNSでお知らせします。",
    },
    {
        id: "9",
        date: "2021.05.01",
        title: "GWのお知らせ",
        content:
            "GW期間中の営業時間についてお知らせします。GW期間中は、特別な営業時間で営業します。詳細な情報は、当店のホームページやSNSでお知らせします。",
    },
    {
        id: "10",
        date: "2021.04.01",
        title: "春の営業時間変更のお知らせ",
        content:
            "春の営業時間を変更します。ご了承ください。春の営業時間変更は、季節の変化に伴うものです。詳細な情報は、当店のホームページやSNSでお知らせします。",
    },
];
